IDEA Open Model
BoltGrid Properties
Compatible with IDEA StatiCa 20.1
The BoltGrid type exposes the following members.
Properties
Name | Description
AnchorLen
 Anchor lenght
AxisX
 Bolt grid LCS - Axis X
AxisY
 Bolt grid LCS - Axis Y
AxisZ
 Bolt grid LCS - Axis Z
BoltAssemblyName
 The description of the bolt assembly
BoreHole
 The BoreHole of bold
ConnectedPartIds
 Id of the weld
ConnectedPlates
 Identifiers of the connected plates
DiagonalHeadDiameter
 The Diagonal Head Diameter of bold
Diameter
 The diameter of bold
HeadDiameter
 The head diameter of bold
HeadHeight
 The Head Height of bold
HoleDiameter
 The diameter of the hole
Id
 Unique Id of the bolt grid
IsAnchor
 Is Anchor
Material
 The material of the bolt assembly
NutThickness
 The Nut Thickness of bold
Origin
 Origin of the bolt grid LCS
Positions
 Positions of holes in the local coodinate system of the bolt grid
Standard
 The standard of the bolt assembly
TensileStressArea
 The Tensile Stress Area of bold
Top
See Also
Reference
BoltGrid Class
IdeaRS.OpenModel.Connection Namespace